package rx.dong.com.rxjoke.model;

import java.util.List;

/**
 * Created by JDD on 2016/4/7.
 */
public class JokeEntity {
    /**
     * showapi_res_code : 0
     * showapi_res_error :
     * showapi_res_body : {"allNum":21320,"allPages":1066,"contentlist":[{"ct":"2016-04-08
     * 14:00:00.676","text":"今天在卫生间拉翔，进行中媳妇进来洗澡，我拉完翔就贱贱的伸出魔爪去摸咪咪，<\/p><p
     * >媳妇说：拉完也不洗手就来，咱娃还能喝上放心奶嘛？。。。。。<\/p><p>瞬间碉堡。","title":"放心奶","type":1},{"ct":"2016-04-08
     * 14:00:00.674",
     * "text":"刚才下楼去买烟，听到士多店老板5
     * 岁的儿子蹲在门口唱：我有一头小毛驴我从来也不骑，有一天我心血来潮骑它去赶集。我手里拿着小皮鞭我心里正得意，不知怎么我的毛驴生了个小Baby。。　　这TM谁教的。。。",
     * "title":"谁教的。。。","type":1},{"ct":"2016-04-08 14:00:00.674",
     * "text":"有一次课上跟我同桌比腿瘦，他是男的，我女的。他非得的说他比我瘦，于是我不服气，拿起他的手摸我的腿，说你快摸啊，你快摸啊。我永远都不会忘记同学们看我的眼神",
     * "title":"你快摸啊","type":1},{"ct":"2016-04-08 14:00:00.674",
     * "text":"我去早市买菜，买了很多，都快拎不动了，这时就听一男人喊：\u201c美女，拎不动了吧？\u201d
     * 扭头一看，猪肉摊上一帅哥正看着我，我暗喜，难道帅哥看我长得漂亮要帮忙？只听帅哥说：\u201c美女买点猪肉吧，吃了猪肉就有力气了，有力气以后就能拎动了\u2026\u2026
     * \u201d","title":"买点猪肉吧","type":1},{"ct":"2016-04-08 14:00:00.674",
     * "text":"老婆：老公，台风要来了！你可要抱紧我，万一我吹到别人家，别人不还怎么办？老公：你可拉倒吧！就你这样，人家顶着风也要把你送回来！","title":"送回来！",
     * "type":1},{"ct":"2016-04-08 14:00:00.673",
     * "text":"一天，我问我哥。我说：哥，当初你是怎么看上嫂子的。我哥说：那是一年夏天，我和你嫂子刚认识的时候，我请你嫂子吃冰棍，我看见她能把一支冰棍全塞嘴里五六秒，于是我就下定决心一定要把她追到手。我：\u2026\u2026\u2026\u2026","title":"一支冰棍全塞嘴里五六秒","type":1},{"ct":"2016-04-08 14:00:00.637","text":"在公厕上厕所，憋了很久，放了个巨长的屁。隔壁的哥们受不了了说：卧槽哥们，你这是要起飞啊。","title":"起飞","type":1},{"ct":"2016-04-08 14:00:00.636","text":"老师：知道什么是法盲吗？同学答：法盲就是法国的文盲。老师：名人呢？同学答：有名字的人。老师：白领的意思呢？同学答：白领工资。","title":"白领","type":1},{"ct":"2016-04-08 14:00:00.636","text":"记得小时候，男孩都喜欢电动玩具，女孩喜欢娃娃；随着年代发展到如今已完全颠覆，女孩喜欢电动玩具，男孩喜欢娃娃。谁能告诉我为啥？","title":"颠覆","type":1},{"ct":"2016-04-08 12:30:42.462","text":"老妈：\u201c过年了，看你期末成绩不错，给你包个大红包，开心吗？\u201d<\/p><p>我：\u201c开心得不要不要的！\u201d<\/p><p>老妈：\u201c啊？不要就算了。\u201d","title":"老妈：\u201c过年了，看你期末成绩不错","type":1},{"ct":"2016-04-08 12:30:42.461","text":"高一新生入学，寄宿生开会，生指老师说：\u201c宿舍就是你的家，大家要团结。\u201d　　一个男生说：\u201c在这个家里谁是我的爸爸妈妈？\u201d　　另一个男生说：\u201c我是你的爸爸。\u201d　　那个男生说：\u201c你每天帮我买早餐。\u201d　　生指老师说：\u201c在这个家里没有爸爸妈妈。\u201d　　那个男生说：\u201c真不幸，我们成了孤儿。\u201d","title":"真不幸，我们成了孤儿","type":1},{"ct":"2016-04-08 12:30:42.461","text":"男朋友上课传给我了个纸包，打开一看是一只粉红色的小兔子。<\/p><p>回纸条：捏的好可爱，哪买的橡皮泥？<\/p><p>他：刚吃完的泡泡糖。","title":"男朋友上课传给我了个纸包","type":1},{"ct":"2016-04-08 12:30:42.443","text":"我的女朋友是个二货，中午吃饭时女友娇滴滴的对我说：你下面太硬。<\/p><p>我迟钝了半天回句：你下面的水太多了。<\/p><p>然后二货女友说道：恩恩，事实证明，煮好一锅面条不是件容易的事。。。","title":"我的女朋友是个二货，","type":1},{"ct":"2016-04-08 12:30:42.443","text":"\u201c你这把年纪。。。\u201d听了会让人不舒服，正确的说法叫做：\u201c在你现在这样的人生阶段。。。\u201d","title":"\u201c你这把年纪。。。\u201d听了会让人不舒服，正","type":1},{"ct":"2016-04-08 12:30:42.442","text":"晚上逛街，看见一大叔趴在地上不动，一看就是喝多了，像我这样帅气又好心的年轻人怎么能袖手旁观呢，于是果断把大叔扶了起来。。。<\/p><p>妈蛋，钱包里居然没钱，还好手机卖了还能赚点。。","title":"晚上逛街，看见一大叔趴在地上不动","type":1},{"ct":"2016-04-08 12:30:42.442","text":"中学时，因为字写得丑，不敢写情书表白；多年后同学聚会，她已为人妻。她告诉我，其实她根本不在乎我字丑，只在乎我人丑。","title":"中学时，因为字写得丑","type":1},{"ct":"2016-04-08 12:30:42.441","text":"跟一2货舍友同去取款，他忽然认真地说：取款机对盲人并不方便，以后数字键应该改成语音播报的，这样盲人就可以听见自己输入的密码对不对了。<\/p><p>听后，我不由得感叹道：现今这社会，如此古道热肠同时又智商低下的人太少了！这朋友我是交定了！","title":"跟一2货舍友同去取款","type":1},{"ct":"2016-04-08 12:30:42.440","text":"半夜想吃红薯，就让媳妇出去买。都特么去了三个钟头了，还没回来。卧槽，我这个担心啊，不会在外面自己吃完回来吧！","title":"半夜想吃红薯，就让媳妇出去买","type":1},{"ct":"2016-04-08 12:30:42.352","text":"1、就刚刚，我看到一个超级帅的男孩，我们就辣么注视对方好久，时间仿佛静止了...直到我拿着镜子的手感到酸疼才作罢。<p><\/p>\r\n2、记得夏天的时候，去同事家做客，午睡的时候，同事问我需要什么东西盖着不？我幽幽的回道：我只需要盖着肚脐就可以。然后...同事立马从眼镜盒里拿块眼镜布给我盖上。<p><\/p>\r\n3、公司女同事穿着齐逼牛仔裙，我坐在她对面赶脚浑身不自在，女同事说：听说穿齐逼小短裙会影响健康，是真的吗？我说：那还用说，我一看到齐逼小短裙血压就飙高\u2026\u2026<p><\/p>\r\n4、开通宵的屌丝最讨人厌了，冲上来就问：包夜多少钱？尼玛，真是一点情调都没有....<p><\/p>......","title":"冷死人的冷笑话","type":1},{"ct":"2016-04-08 12:00:00.828","text":"老王最爱挑毛病，恨不得鸡蛋里挑出骨头。　　一日，去朋友家喝满月酒，对着婴儿左挑右挑没挑出毛病。　　最后说：总体上还行，就是太幼稚了。　　朋友：\u2026\u2026","title":"老王最爱挑毛病","type":1}],"currentPage":1,"maxResult":20,"ret_code":0}
     */

    private int showapi_res_code;
    private String showapi_res_error;
    /**
     * allNum : 21320
     * allPages : 1066
     * contentlist : [{"ct":"2016-04-08 14:00:00.676",
     * "text":"今天在卫生间拉翔，进行中媳妇进来洗澡，我拉完翔就贱贱的伸出魔爪去摸咪咪，<\/p><p>媳妇说：拉完也不洗手就来，咱娃还能喝上放心奶嘛？。。。。。<\/p><p
     * >瞬间碉堡。","title":"放心奶","type":1},{"ct":"2016-04-08 14:00:00.674",
     * "text":"刚才下楼去买烟，听到士多店老板5
     * 岁的儿子蹲在门口唱：我有一头小毛驴我从来也不骑，有一天我心血来潮骑它去赶集。我手里拿着小皮鞭我心里正得意，不知怎么我的毛驴生了个小Baby。。　　这TM谁教的。。。",
     * "title":"谁教的。。。","type":1},{"ct":"2016-04-08 14:00:00.674",
     * "text":"有一次课上跟我同桌比腿瘦，他是男的，我女的。他非得的说他比我瘦，于是我不服气，拿起他的手摸我的腿，说你快摸啊，你快摸啊。我永远都不会忘记同学们看我的眼神",
     * "title":"你快摸啊","type":1},{"ct":"2016-04-08 14:00:00.674",
     * "text":"我去早市买菜，买了很多，都快拎不动了，这时就听一男人喊：\u201c美女，拎不动了吧？\u201d
     * 扭头一看，猪肉摊上一帅哥正看着我，我暗喜，难道帅哥看我长得漂亮要帮忙？只听帅哥说：\u201c美女买点猪肉吧，吃了猪肉就有力气了，有力气以后就能拎动了\u2026\u2026
     * \u201d","title":"买点猪肉吧","type":1},{"ct":"2016-04-08 14:00:00.674",
     * "text":"老婆：老公，台风要来了！你可要抱紧我，万一我吹到别人家，别人不还怎么办？老公：你可拉倒吧！就你这样，人家顶着风也要把你送回来！","title":"送回来！",
     * "type":1},{"ct":"2016-04-08 14:00:00.673",
     * "text":"一天，我问我哥。我说：哥，当初你是怎么看上嫂子的。我哥说：那是一年夏天，我和你嫂子刚认识的时候，我请你嫂子吃冰棍，我看见她能把一支冰棍全塞嘴里五六秒，于是我就下定决心一定要把她追到手。我：\u2026\u2026\u2026\u2026","title":"一支冰棍全塞嘴里五六秒","type":1},{"ct":"2016-04-08 14:00:00.637","text":"在公厕上厕所，憋了很久，放了个巨长的屁。隔壁的哥们受不了了说：卧槽哥们，你这是要起飞啊。","title":"起飞","type":1},{"ct":"2016-04-08 14:00:00.636","text":"老师：知道什么是法盲吗？同学答：法盲就是法国的文盲。老师：名人呢？同学答：有名字的人。老师：白领的意思呢？同学答：白领工资。","title":"白领","type":1},{"ct":"2016-04-08 14:00:00.636","text":"记得小时候，男孩都喜欢电动玩具，女孩喜欢娃娃；随着年代发展到如今已完全颠覆，女孩喜欢电动玩具，男孩喜欢娃娃。谁能告诉我为啥？","title":"颠覆","type":1},{"ct":"2016-04-08 12:30:42.462","text":"老妈：\u201c过年了，看你期末成绩不错，给你包个大红包，开心吗？\u201d<\/p><p>我：\u201c开心得不要不要的！\u201d<\/p><p>老妈：\u201c啊？不要就算了。\u201d","title":"老妈：\u201c过年了，看你期末成绩不错","type":1},{"ct":"2016-04-08 12:30:42.461","text":"高一新生入学，寄宿生开会，生指老师说：\u201c宿舍就是你的家，大家要团结。\u201d　　一个男生说：\u201c在这个家里谁是我的爸爸妈妈？\u201d　　另一个男生说：\u201c我是你的爸爸。\u201d　　那个男生说：\u201c你每天帮我买早餐。\u201d　　生指老师说：\u201c在这个家里没有爸爸妈妈。\u201d　　那个男生说：\u201c真不幸，我们成了孤儿。\u201d","title":"真不幸，我们成了孤儿","type":1},{"ct":"2016-04-08 12:30:42.461","text":"男朋友上课传给我了个纸包，打开一看是一只粉红色的小兔子。<\/p><p>回纸条：捏的好可爱，哪买的橡皮泥？<\/p><p>他：刚吃完的泡泡糖。","title":"男朋友上课传给我了个纸包","type":1},{"ct":"2016-04-08 12:30:42.443","text":"我的女朋友是个二货，中午吃饭时女友娇滴滴的对我说：你下面太硬。<\/p><p>我迟钝了半天回句：你下面的水太多了。<\/p><p>然后二货女友说道：恩恩，事实证明，煮好一锅面条不是件容易的事。。。","title":"我的女朋友是个二货，","type":1},{"ct":"2016-04-08 12:30:42.443","text":"\u201c你这把年纪。。。\u201d听了会让人不舒服，正确的说法叫做：\u201c在你现在这样的人生阶段。。。\u201d","title":"\u201c你这把年纪。。。\u201d听了会让人不舒服，正","type":1},{"ct":"2016-04-08 12:30:42.442","text":"晚上逛街，看见一大叔趴在地上不动，一看就是喝多了，像我这样帅气又好心的年轻人怎么能袖手旁观呢，于是果断把大叔扶了起来。。。<\/p><p>妈蛋，钱包里居然没钱，还好手机卖了还能赚点。。","title":"晚上逛街，看见一大叔趴在地上不动","type":1},{"ct":"2016-04-08 12:30:42.442","text":"中学时，因为字写得丑，不敢写情书表白；多年后同学聚会，她已为人妻。她告诉我，其实她根本不在乎我字丑，只在乎我人丑。","title":"中学时，因为字写得丑","type":1},{"ct":"2016-04-08 12:30:42.441","text":"跟一2货舍友同去取款，他忽然认真地说：取款机对盲人并不方便，以后数字键应该改成语音播报的，这样盲人就可以听见自己输入的密码对不对了。<\/p><p>听后，我不由得感叹道：现今这社会，如此古道热肠同时又智商低下的人太少了！这朋友我是交定了！","title":"跟一2货舍友同去取款","type":1},{"ct":"2016-04-08 12:30:42.440","text":"半夜想吃红薯，就让媳妇出去买。都特么去了三个钟头了，还没回来。卧槽，我这个担心啊，不会在外面自己吃完回来吧！","title":"半夜想吃红薯，就让媳妇出去买","type":1},{"ct":"2016-04-08 12:30:42.352","text":"1、就刚刚，我看到一个超级帅的男孩，我们就辣么注视对方好久，时间仿佛静止了...直到我拿着镜子的手感到酸疼才作罢。<p><\/p>\r\n2、记得夏天的时候，去同事家做客，午睡的时候，同事问我需要什么东西盖着不？我幽幽的回道：我只需要盖着肚脐就可以。然后...同事立马从眼镜盒里拿块眼镜布给我盖上。<p><\/p>\r\n3、公司女同事穿着齐逼牛仔裙，我坐在她对面赶脚浑身不自在，女同事说：听说穿齐逼小短裙会影响健康，是真的吗？我说：那还用说，我一看到齐逼小短裙血压就飙高\u2026\u2026<p><\/p>\r\n4、开通宵的屌丝最讨人厌了，冲上来就问：包夜多少钱？尼玛，真是一点情调都没有....<p><\/p>......","title":"冷死人的冷笑话","type":1},{"ct":"2016-04-08 12:00:00.828","text":"老王最爱挑毛病，恨不得鸡蛋里挑出骨头。　　一日，去朋友家喝满月酒，对着婴儿左挑右挑没挑出毛病。　　最后说：总体上还行，就是太幼稚了。　　朋友：\u2026\u2026","title":"老王最爱挑毛病","type":1}]
     * currentPage : 1
     * maxResult : 20
     * ret_code : 0
     */

    private ShowapiResBodyEntity showapi_res_body;

    public int getShowapi_res_code() {
        return showapi_res_code;
    }

    public void setShowapi_res_code(int showapi_res_code) {
        this.showapi_res_code = showapi_res_code;
    }

    public String getShowapi_res_error() {
        return showapi_res_error;
    }

    public void setShowapi_res_error(String showapi_res_error) {
        this.showapi_res_error = showapi_res_error;
    }

    public ShowapiResBodyEntity getShowapi_res_body() {
        return showapi_res_body;
    }

    public void setShowapi_res_body(ShowapiResBodyEntity showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public static class ShowapiResBodyEntity {
        private int allNum;
        private int allPages;
        private int currentPage;
        private int maxResult;
        private int ret_code;
        /**
         * ct : 2016-04-08 14:00:00.676
         * text : 今天在卫生间拉翔，进行中媳妇进来洗澡，我拉完翔就贱贱的伸出魔爪去摸咪咪，</p><p>媳妇说：拉完也不洗手就来，咱娃还能喝上放心奶嘛？。。。。。</p><p
         * >瞬间碉堡。
         * title : 放心奶
         * type : 1
         */

        private List<ContentlistEntity> contentlist;

        public int getAllNum() {
            return allNum;
        }

        public void setAllNum(int allNum) {
            this.allNum = allNum;
        }

        public int getAllPages() {
            return allPages;
        }

        public void setAllPages(int allPages) {
            this.allPages = allPages;
        }

        public int getCurrentPage() {
            return currentPage;
        }

        public void setCurrentPage(int currentPage) {
            this.currentPage = currentPage;
        }

        public int getMaxResult() {
            return maxResult;
        }

        public void setMaxResult(int maxResult) {
            this.maxResult = maxResult;
        }

        public int getRet_code() {
            return ret_code;
        }

        public void setRet_code(int ret_code) {
            this.ret_code = ret_code;
        }

        public List<ContentlistEntity> getContentlist() {
            return contentlist;
        }

        public void setContentlist(List<ContentlistEntity> contentlist) {
            this.contentlist = contentlist;
        }

    }
}

